<a href="https://colab.research.google.com/github/SEJUNTONY/Data_Science_Class/blob/SOOB/%EC%A7%80%EC%88%98%EB%B9%88_%EC%B2%AD%EB%AC%BC%ED%8F%AC%EB%8D%B0%EC%82%AC_1014%EB%B6%80%EC%82%B0%ED%95%AD.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import numpy as np #pandas는 기본적으로 넘비를 기본으로 만들었다
import pandas as pd
pd.__version__ #실행은 플레이버튼 혹은 컨트롤 엔터
#플레이 결과 판다스 버전이 나옴

'1.1.5'

In [3]:
#코드 추가는 위 버튼 혹은 컨트롤mb
s1=pd.Series([0,0.25,0.5,0.75,1.0]) #리스트와 같은 기능
s1

0    0.00
1    0.25
2    0.50
3    0.75
4    1.00
dtype: float64

In [4]:
s1.index #55번째에서 멈춘다는것 4번째거밖에 없다는것

RangeIndex(start=0, stop=5, step=1)

In [5]:
s1.values

array([0.  , 0.25, 0.5 , 0.75, 1.  ])

In [6]:
s1[1]

0.25

In [8]:
s2=pd.Series([0,0.25,0.5,0.75,1], index=['a','b','c','d','e'])
s2 #둘을 매핑시켜주는 것

a    0.00
b    0.25
c    0.50
d    0.75
e    1.00
dtype: float64

In [9]:
s2['c']

0.5

In [12]:
'b' in s2 #b가 s2인덱스에 존재하는가

True

In [13]:
s3 = pd.Series(['정은지','지수빈','정주희','박세준','정찬호'],index=['하나','둘','셋','넷','다섯'], name='출석부')
s3

하나    정은지
둘     지수빈
셋     정주희
넷     박세준
다섯    정찬호
Name: 출석부, dtype: object

In [14]:
s3.unique() #()의 의미는 변수는 필요없다는 것 유니크는 겹치지 않는 값을 보여줌

array(['정은지', '지수빈', '정주희', '박세준', '정찬호'], dtype=object)

In [15]:
s3 == '정찬호'

하나    False
둘     False
셋     False
넷     False
다섯     True
Name: 출석부, dtype: bool

In [16]:
pop_tuple = {'서울특별시':9720846,
             '부산광역시':3404423,
             '인천광역시':2947217,
             '대구광역시':2427954,
             '대전광역시':1471040,
             '광주광역시':1455048}
population = pd.Series(pop_tuple)
population #튜플과 똑같음 목차임 서울에 97~저값이 들어가있다 튜플은 중괄호사용
#제목 먼저 쓴 후  : 하고 값 입력 pop_tuple은 그냥 변수 아무거나 써도 상관없음

서울특별시    9720846
부산광역시    3404423
인천광역시    2947217
대구광역시    2427954
대전광역시    1471040
광주광역시    1455048
dtype: int64

In [18]:
#데이터프레임 이게 진짜임-2차원 표
pd.DataFrame([{'A':2,'B':4,'D':3},{'A':4,'B':5,'C':7}]) #{}사이를 , 로 바꿔줌으로 행추가 
#없는 부분은 NaN으로 표시
# {}이게 튜플부분임

   A  B    D    C
0  2  4  3.0  NaN
1  4  5  NaN  7.0

In [19]:
pd.DataFrame(np.random.rand(5,5),
             columns=['A','B','C','D','E'],
             index=[1,2,3,4,5])
#튜플형식아니어도 할 수 있음

          A         B         C         D         E
1  0.427751  0.837762  0.789557  0.132740  0.358586
2  0.349466  0.808043  0.039920  0.373629  0.696481
3  0.278750  0.336891  0.448245  0.712683  0.916065
4  0.728629  0.242751  0.106389  0.560701  0.059532
5  0.699857  0.415803  0.507433  0.656622  0.772959

In [20]:
male_tuple = {'서울특별시':4732275,
             '부산광역시':1668618,
             '인천광역시':1476813,
             '대구광역시':1198815,
             '대전광역시':734441,
             '광주광역시':720060}
male = pd.Series(male_tuple)
male

서울특별시    4732275
부산광역시    1668618
인천광역시    1476813
대구광역시    1198815
대전광역시     734441
광주광역시     720060
dtype: int64

In [21]:

female_tuple = {'서울특별시':4988571,
             '부산광역시':1735805,
             '인천광역시':1470404,
             '대구광역시':1229139,
             '대전광역시':736599,
             '광주광역시':734988}
female = pd.Series(female_tuple)
female

서울특별시    4988571
부산광역시    1735805
인천광역시    1470404
대구광역시    1229139
대전광역시     736599
광주광역시     734988
dtype: int64

In [22]:
korea_df = pd.DataFrame({'인구수':population,
                        '남자인구수' : male,
                         '여자인구수' : female})
korea_df #변수명은 의미X / 위의 튜플 형식 3개 다 합친것임!
#인덱스달라도 오류X 추가되는데 NAN뜸!

           인구수    남자인구수    여자인구수
서울특별시  9720846  4732275  4988571
부산광역시  3404423  1668618  1735805
인천광역시  2947217  1476813  1470404
대구광역시  2427954  1198815  1229139
대전광역시  1471040   734441   736599
광주광역시  1455048   720060   734988

In [24]:
korea_df.index #인덱스 이름

Index(['서울특별시', '부산광역시', '인천광역시', '대구광역시', '대전광역시', '광주광역시'], dtype='object')

In [25]:
korea_df.columns

Index(['인구수', '남자인구수', '여자인구수'], dtype='object')

In [26]:
korea_df['여자인구수']

서울특별시    4988571
부산광역시    1735805
인천광역시    1470404
대구광역시    1229139
대전광역시     736599
광주광역시     734988
Name: 여자인구수, dtype: int64

In [27]:
korea_df['서울특별시':'인천광역시'] #서울특별시부터 인천까지!

           인구수    남자인구수    여자인구수
서울특별시  9720846  4732275  4988571
부산광역시  3404423  1668618  1735805
인천광역시  2947217  1476813  1470404

In [29]:
#데이터 불러오기-승인받는것 플레이되고 나오는 링크들어가서 인증
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [32]:
# 불러올 파일의 경로를 filename 변수에 저장
filename = '/content/drive/MyDrive/부산항_2021.csv' #드라이브 내 파일 경로복사 
# Pandas read_csv로 불러오기
seadata2 = pd.read_csv(filename) #파일 불러오는 함수
seadata2.head() #위에서 몇 개의 데이터를 가져올건지 기본값이 5개라서 5개가 출력된것 
#()안에 숫자 넣으면 그 숫자만큼 데이터 출력됨

         출항        입항     외항 입항     외항 출항    외국선 입항    외국선 출항   국적선 입항   국적선 출항
0  18374306  16379285  16379285  18374306  30780481  14548165  1831120  2141990
1  17033243  14618183  14618183  17033243  27694240  12701895  1916288  2040898
2  19721734  17151498  17151498  19721734  32538031  14886176  2265322  2069879
3  18356391  18266865  18266865  18356391  32305352  16173092  2093773  2224131
4  19652544  17507307  17507307  19652544  32795440  15500336  2006971  2357440

In [33]:
seadata2.shape
# 이 데이터에 index의 개수는 7개 #여기는 HEAD설정해서 5개만 보이는데 원래 7개임
# Column의 개수는 8개

(7, 8)

In [34]:
seadata2.info() #분석 디타입:데이터타입 넌눌: 값에 빈값이 있으면 눌 아니면 넌눌 
#데이터가 방대해지면 어디서 결측이 생기는지 확인할 수 있음

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   출항      7 non-null      int64
 1   입항      7 non-null      int64
 2   외항 입항   7 non-null      int64
 3   외항 출항   7 non-null      int64
 4   외국선 입항  7 non-null      int64
 5   외국선 출항  7 non-null      int64
 6   국적선 입항  7 non-null      int64
 7   국적선 출항  7 non-null      int64
dtypes: int64(8)
memory usage: 576.0 bytes

In [35]:

seadata2.describe() #통계치 계산
#카운트:데이터개수 민은 평균 @STD 표준편차

                 출항            입항  ...        국적선 입항        국적선 출항
count  7.000000e+00  7.000000e+00  ...  7.000000e+00  7.000000e+00
mean   1.876015e+07  1.702029e+07  ...  2.074419e+06  2.191097e+06
std    9.419427e+05  1.208136e+06  ...  1.920402e+05  1.973596e+05
min    1.703324e+07  1.461818e+07  ...  1.831120e+06  1.970656e+06
25%    1.836535e+07  1.676539e+07  ...  1.961630e+06  2.055388e+06
50%    1.888054e+07  1.741710e+07  ...  2.027284e+06  2.141990e+06
75%    1.947742e+07  1.765455e+07  ...  2.179548e+06  2.290786e+06
max    1.972173e+07  1.826686e+07  ...  2.380176e+06  2.532688e+06

[8 rows x 8 columns]

`